zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_samb11zr.h
/**
 * \file
 *
 * \brief Peripheral I/O description for SAMB11ZR
 *
 * Copyright (c) 2016 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11ZR_PIO_
#define _SAMB11ZR_PIO_

#define GPIO_LP_GPIO_0           (1u << 0)  /**< \brief Pin Controlled by LP_GPIO_0 */
#define GPIO_LP_GPIO_0_IDX               0 
#define GPIO_LP_GPIO_1           (1u << 1)  /**< \brief Pin Controlled by LP_GPIO_1 */
#define GPIO_LP_GPIO_1_IDX               1 
#define GPIO_LP_GPIO_2           (1u << 2)  /**< \brief Pin Controlled by LP_GPIO_2 */
#define GPIO_LP_GPIO_2_IDX               2 
#define GPIO_LP_GPIO_3           (1u << 3)  /**< \brief Pin Controlled by LP_GPIO_3 */
#define GPIO_LP_GPIO_3_IDX               3 
#define GPIO_LP_GPIO_4           (1u << 4)  /**< \brief Pin Controlled by LP_GPIO_4 */
#define GPIO_LP_GPIO_4_IDX               4 
#define GPIO_LP_GPIO_5           (1u << 5)  /**< \brief Pin Controlled by LP_GPIO_5 */
#define GPIO_LP_GPIO_5_IDX               5 
#define GPIO_LP_GPIO_6           (1u << 6)  /**< \brief Pin Controlled by LP_GPIO_6 */
#define GPIO_LP_GPIO_6_IDX               6 
#define GPIO_LP_GPIO_7           (1u << 7)  /**< \brief Pin Controlled by LP_GPIO_7 */
#define GPIO_LP_GPIO_7_IDX               7 
#define GPIO_LP_GPIO_8           (1u << 8)  /**< \brief Pin Controlled by LP_GPIO_8 */
#define GPIO_LP_GPIO_8_IDX               8 
#define GPIO_LP_GPIO_9           (1u << 9)  /**< \brief Pin Controlled by LP_GPIO_9 */
#define GPIO_LP_GPIO_9_IDX               9 
#define GPIO_LP_GPIO_10          (1u << 10) /**< \brief Pin Controlled by LP_GPIO_10 */
#define GPIO_LP_GPIO_10_IDX              10
#define GPIO_LP_GPIO_11          (1u << 11) /**< \brief Pin Controlled by LP_GPIO_11 */
#define GPIO_LP_GPIO_11_IDX              11
#define GPIO_LP_GPIO_12          (1u << 12) /**< \brief Pin Controlled by LP_GPIO_12 */
#define GPIO_LP_GPIO_12_IDX              12
#define GPIO_LP_GPIO_13          (1u << 13) /**< \brief Pin Controlled by LP_GPIO_13 */
#define GPIO_LP_GPIO_13_IDX              13
#define GPIO_LP_GPIO_14          (1u << 14) /**< \brief Pin Controlled by LP_GPIO_14 */
#define GPIO_LP_GPIO_14_IDX              14
#define GPIO_LP_GPIO_15          (1u << 15) /**< \brief Pin Controlled by LP_GPIO_15 */
#define GPIO_LP_GPIO_15_IDX              15
#define GPIO_LP_GPIO_16          (1u << 0)  /**< \brief Pin Controlled by LP_GPIO_16 */
#define GPIO_LP_GPIO_16_IDX              16
#define GPIO_LP_GPIO_17          (1u << 1)  /**< \brief Pin Controlled by LP_GPIO_17 */
#define GPIO_LP_GPIO_17_IDX              17
#define GPIO_LP_GPIO_18          (1u << 2)  /**< \brief Pin Controlled by LP_GPIO_18 */
#define GPIO_LP_GPIO_18_IDX              18
#define GPIO_LP_GPIO_19          (1u << 3)  /**< \brief Pin Controlled by LP_GPIO_19 */
#define GPIO_LP_GPIO_19_IDX              19
#define GPIO_AO_GPIO_2           (1u << 13) /**< \brief Pin Controlled by AO_GPIO_2 */
#define GPIO_AO_GPIO_2_IDX               29
#define GPIO_AO_GPIO_1           (1u << 14) /**< \brief Pin Controlled by AO_GPIO_1 */
#define GPIO_AO_GPIO_1_IDX               30
#define GPIO_AO_GPIO_0           (1u << 15) /**< \brief Pin Controlled by AO_GPIO_0 */
#define GPIO_AO_GPIO_0_IDX               31
#define GPIO_GPIO_MS4            (1u << 12) /**< \brief Pin Controlled by GPIO_MS4 */
#define GPIO_GPIO_MS4_IDX                44
#define GPIO_GPIO_MS3            (1u << 13) /**< \brief Pin Controlled by GPIO_MS3 */
#define GPIO_GPIO_MS3_IDX                45
#define GPIO_GPIO_MS2            (1u << 14) /**< \brief Pin Controlled by GPIO_MS2 */
#define GPIO_GPIO_MS2_IDX                46
#define GPIO_GPIO_MS1            (1u << 15) /**< \brief Pin Controlled by GPIO_MS1 */
#define GPIO_GPIO_MS1_IDX                47

/* PinMux definitions                                               */
/* Mux values for LP_GPIO_0 */
#define MUX_LP_GPIO_0_GPIO                     0x0
#define MUX_LP_GPIO_0_MEGAMUX                  0x1
#define MUX_LP_GPIO_0_SWD_CLK                  0x2
#define MUX_LP_GPIO_0_TEST_OUT_0               0x7
/* Mux values for LP_GPIO_1 */
#define MUX_LP_GPIO_1_GPIO                     0x0
#define MUX_LP_GPIO_1_SWD_IO                   0x2
#define MUX_LP_GPIO_1_MEGAMUX                  0x1
#define MUX_LP_GPIO_1_TEST_OUT_1               0x7
/* Mux values for LP_GPIO_2 */
#define MUX_LP_GPIO_2_MEGAMUX                  0x1
#define MUX_LP_GPIO_2_SPI_FLASH0_SCK           0x6
#define MUX_LP_GPIO_2_SPI1_SCK                 0x4
#define MUX_LP_GPIO_2_TEST_OUT_2               0x7
#define MUX_LP_GPIO_2_UART0_RXD                0x2
#define MUX_LP_GPIO_2_GPIO                     0x0
#define MUX_LP_GPIO_2_SPI0_SCK                 0x5
/* Mux values for LP_GPIO_3 */
#define MUX_LP_GPIO_3_UART0_TXD                0x2
#define MUX_LP_GPIO_3_SPI0_MOSI                0x5
#define MUX_LP_GPIO_3_MEGAMUX                  0x1
#define MUX_LP_GPIO_3_SPI1_MOSI                0x4
#define MUX_LP_GPIO_3_SPI_FLASH0_TXD           0x6
#define MUX_LP_GPIO_3_TEST_OUT_3               0x7
#define MUX_LP_GPIO_3_GPIO                     0x0
/* Mux values for LP_GPIO_4 */
#define MUX_LP_GPIO_4_MEGAMUX                  0x1
#define MUX_LP_GPIO_4_UART0_CTS                0x2
#define MUX_LP_GPIO_4_SPI0_SSN                 0x5
#define MUX_LP_GPIO_4_SPI_FLASH0_SSN           0x6
#define MUX_LP_GPIO_4_TEST_OUT_4               0x7
#define MUX_LP_GPIO_4_GPIO                     0x0
#define MUX_LP_GPIO_4_SPI1_SSN                 0x4
/* Mux values for LP_GPIO_5 */
#define MUX_LP_GPIO_5_SPI_FLASH0_RXD           0x6
#define MUX_LP_GPIO_5_MEGAMUX                  0x1
#define MUX_LP_GPIO_5_SPI0_MISO                0x5
#define MUX_LP_GPIO_5_SPI1_MISO                0x4
#define MUX_LP_GPIO_5_TEST_OUT_5               0x7
#define MUX_LP_GPIO_5_UART0_RTS                0x2
#define MUX_LP_GPIO_5_GPIO                     0x0
/* Mux values for LP_GPIO_6 */
#define MUX_LP_GPIO_6_MEGAMUX                  0x1
#define MUX_LP_GPIO_6_SPI_FLASH0_SCK           0x6
#define MUX_LP_GPIO_6_UART1_RXD                0x2
#define MUX_LP_GPIO_6_TEST_OUT_6               0x7
#define MUX_LP_GPIO_6_GPIO                     0x0
#define MUX_LP_GPIO_6_SPI0_SCK                 0x5
/* Mux values for LP_GPIO_7 */
#define MUX_LP_GPIO_7_SPI0_MOSI                0x5
#define MUX_LP_GPIO_7_UART1_TXD                0x2
#define MUX_LP_GPIO_7_MEGAMUX                  0x1
#define MUX_LP_GPIO_7_TEST_OUT_7               0x7
#define MUX_LP_GPIO_7_SPI_FLASH0_TXD           0x6
#define MUX_LP_GPIO_7_GPIO                     0x0
/* Mux values for LP_GPIO_8 */
#define MUX_LP_GPIO_8_MEGAMUX                  0x1
#define MUX_LP_GPIO_8_SPI0_SSN                 0x5
#define MUX_LP_GPIO_8_SPI_FLASH0_SSN           0x6
#define MUX_LP_GPIO_8_GPIO                     0x0
#define MUX_LP_GPIO_8_I2C0_SDA                 0x2
#define MUX_LP_GPIO_8_TEST_OUT_8               0x7
/* Mux values for LP_GPIO_9 */
#define MUX_LP_GPIO_9_SPI_FLASH0_RXD           0x6
#define MUX_LP_GPIO_9_MEGAMUX                  0x1
#define MUX_LP_GPIO_9_SPI0_MISO                0x5
#define MUX_LP_GPIO_9_I2C0_SCL                 0x2
#define MUX_LP_GPIO_9_GPIO                     0x0
#define MUX_LP_GPIO_9_TEST_OUT_9               0x7
/* Mux values for LP_GPIO_10 */
#define MUX_LP_GPIO_10_GPIO                    0x0
#define MUX_LP_GPIO_10_MEGAMUX                 0x1
#define MUX_LP_GPIO_10_TEST_OUT_10             0x7
#define MUX_LP_GPIO_10_SPI_FLASH0_SCK          0x6
#define MUX_LP_GPIO_10_SPI0_SCK                0x2
/* Mux values for LP_GPIO_11 */
#define MUX_LP_GPIO_11_SPI0_MOSI               0x2
#define MUX_LP_GPIO_11_GPIO                    0x0
#define MUX_LP_GPIO_11_MEGAMUX                 0x1
#define MUX_LP_GPIO_11_SPI_FLASH0_TXD          0x6
#define MUX_LP_GPIO_11_TEST_OUT_11             0x7
/* Mux values for LP_GPIO_12 */
#define MUX_LP_GPIO_12_SPI_FLASH0_SSN          0x6
#define MUX_LP_GPIO_12_GPIO                    0x0
#define MUX_LP_GPIO_12_SPI0_SSN                0x2
#define MUX_LP_GPIO_12_MEGAMUX                 0x1
#define MUX_LP_GPIO_12_TEST_OUT_12             0x7
/* Mux values for LP_GPIO_13 */
#define MUX_LP_GPIO_13_GPIO                    0x0
#define MUX_LP_GPIO_13_SPI_FLASH0_RXD          0x6
#define MUX_LP_GPIO_13_MEGAMUX                 0x1
#define MUX_LP_GPIO_13_SPI0_MISO               0x2
#define MUX_LP_GPIO_13_TEST_OUT_13             0x7
/* Mux values for LP_GPIO_14 */
#define MUX_LP_GPIO_14_TEST_OUT_14             0x7
#define MUX_LP_GPIO_14_GPIO                    0x0
#define MUX_LP_GPIO_14_I2C1_SDA                0x4
#define MUX_LP_GPIO_14_MEGAMUX                 0x1
#define MUX_LP_GPIO_14_UART1_CTS               0x2
/* Mux values for LP_GPIO_15 */
#define MUX_LP_GPIO_15_GPIO                    0x0
#define MUX_LP_GPIO_15_MEGAMUX                 0x1
#define MUX_LP_GPIO_15_UART1_RTS               0x2
#define MUX_LP_GPIO_15_I2C1_SCL                0x4
#define MUX_LP_GPIO_15_TEST_OUT_15             0x7
/* Mux values for LP_GPIO_16 */
#define MUX_LP_GPIO_16_MEGAMUX                 0x1
#define MUX_LP_GPIO_16_SPI_FLASH0_SCK          0x2
#define MUX_LP_GPIO_16_TEST_OUT_16             0x7
#define MUX_LP_GPIO_16_SPI_FLASH0_SSN          0x6
#define MUX_LP_GPIO_16_GPIO                    0x0
#define MUX_LP_GPIO_16_SPI1_SSN                0x4
#define MUX_LP_GPIO_16_SPI0_SCK                0x5
/* Mux values for LP_GPIO_17 */
#define MUX_LP_GPIO_17_SPI0_MOSI               0x5
#define MUX_LP_GPIO_17_MEGAMUX                 0x1
#define MUX_LP_GPIO_17_TEST_OUT_17             0x7
#define MUX_LP_GPIO_17_SPI1_SCK                0x4
#define MUX_LP_GPIO_17_SPI_FLASH0_TXD          0x2
#define MUX_LP_GPIO_17_GPIO                    0x0
/* Mux values for LP_GPIO_18 */
#define MUX_LP_GPIO_18_SPI_FLASH0_RXD          0x6
#define MUX_LP_GPIO_18_MEGAMUX                 0x1
#define MUX_LP_GPIO_18_TEST_OUT_18             0x7
#define MUX_LP_GPIO_18_SPI0_SSN                0x5
#define MUX_LP_GPIO_18_SPI1_MISO               0x4
#define MUX_LP_GPIO_18_SPI_FLASH0_SSN          0x2
#define MUX_LP_GPIO_18_GPIO                    0x0
/* Mux values for LP_GPIO_19 */
#define MUX_LP_GPIO_19_SPI_FLASH0_RXD          0x2
#define MUX_LP_GPIO_19_MEGAMUX                 0x1
#define MUX_LP_GPIO_19_SPI0_MISO               0x5
#define MUX_LP_GPIO_19_TEST_OUT_19             0x7
#define MUX_LP_GPIO_19_SPI1_MOSI               0x4
#define MUX_LP_GPIO_19_GPIO                    0x0

