zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_samb11zr.h
#define MEGAMUX_LP_GPIO_12_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_12_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_12_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_12_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_12_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_12_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_12_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_12_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_12_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_12_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_12_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_12_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_12_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_12_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_12_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_12_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_12_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_12_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_12_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_12_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_12_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_12_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_12_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_12_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_12_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_12_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_12_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_12_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_12_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_12_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_13 */
#define MEGAMUX_LP_GPIO_13_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_13_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_13_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_13_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_13_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_13_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_13_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_13_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_13_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_13_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_13_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_13_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_13_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_13_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_13_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_13_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_13_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_13_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_13_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_13_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_13_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_13_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_13_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_13_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_13_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_13_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_13_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_13_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_13_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_13_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_13_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_13_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_14 */
#define MEGAMUX_LP_GPIO_14_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_14_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_14_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_14_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_14_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_14_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_14_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_14_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_14_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_14_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_14_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_14_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_14_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_14_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_14_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_14_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_14_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_14_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_14_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_14_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_14_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_14_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_14_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_14_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_14_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_14_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_14_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_14_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_14_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_14_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_14_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_15 */
#define MEGAMUX_LP_GPIO_15_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_15_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_15_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_15_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_15_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_15_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_15_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_15_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_15_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_15_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_15_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_15_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_15_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_15_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_15_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_15_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_15_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_15_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_15_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_15_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_15_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_15_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_15_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_15_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_15_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_15_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_15_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_15_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_15_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_15_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_15_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_16 */
#define MEGAMUX_LP_GPIO_16_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_16_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_16_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_16_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_16_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_16_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_16_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_16_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_16_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_16_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_16_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_16_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_16_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_16_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_16_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_16_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_16_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_16_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_16_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_16_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_16_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_16_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_16_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_16_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_16_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_16_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_16_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_16_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_16_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_16_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_16_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_17 */
#define MEGAMUX_LP_GPIO_17_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_17_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_17_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_17_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_17_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_17_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_17_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_17_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_17_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_17_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_17_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_17_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_17_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_17_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_17_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_17_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_17_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_17_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_17_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_17_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_17_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_17_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_17_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_17_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_17_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_17_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_17_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_17_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_17_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_17_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_17_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_18 */
#define MEGAMUX_LP_GPIO_18_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_18_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_18_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_18_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_18_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_18_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_18_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_18_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_18_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_18_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_18_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_18_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_18_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_18_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_18_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_18_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_18_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_18_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_18_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_18_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_18_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_18_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_18_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_18_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_18_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_18_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_18_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_18_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_18_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_18_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_18_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_19 */
#define MEGAMUX_LP_GPIO_19_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_19_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_19_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_19_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_19_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_19_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_19_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_19_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_19_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_19_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_19_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_19_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_19_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_19_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_19_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_19_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_19_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_19_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_19_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_19_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_19_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_19_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_19_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_19_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_19_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_19_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_19_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_19_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_19_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_19_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_19_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_20 */
#define MEGAMUX_LP_GPIO_20_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_20_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_20_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_20_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_20_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_20_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_20_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_20_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_20_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_20_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_20_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_20_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_20_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_20_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_20_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_20_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_20_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_20_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_20_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_20_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_20_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_20_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_20_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_20_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_20_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_20_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_20_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_20_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_20_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_20_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_20_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_20_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_20_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_20_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_20_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_21 */
#define MEGAMUX_LP_GPIO_21_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_21_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_21_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_21_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_21_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_21_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_21_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_21_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_21_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_21_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_21_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_21_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_21_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_21_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_21_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_21_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_21_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_21_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_21_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_21_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_21_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_21_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_21_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_21_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_21_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_21_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_21_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_21_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_21_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_21_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_21_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_21_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_21_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_21_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_21_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_22 */
#define MEGAMUX_LP_GPIO_22_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_22_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_22_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_22_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_22_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_22_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_22_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_22_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_22_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_22_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_22_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_22_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_22_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_22_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_22_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_22_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_22_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_22_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_22_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_22_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_22_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_22_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_22_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_22_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_22_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_22_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_22_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_22_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_22_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_22_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_22_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_22_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_22_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_22_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_22_PWM2_OUT                0xe
/* MegaMux values for LP_GPIO_23 */
#define MEGAMUX_LP_GPIO_23_I2C0_SCL                0x9
#define MEGAMUX_LP_GPIO_23_UART1_CTS               0x6
#define MEGAMUX_LP_GPIO_23_COEX_BLE_MBSY           0x16
#define MEGAMUX_LP_GPIO_23_COEX_BLE_TX             0x13
#define MEGAMUX_LP_GPIO_23_UART0_RTS               0x3
#define MEGAMUX_LP_GPIO_23_UART0_RXD               0x0
#define MEGAMUX_LP_GPIO_23_32KHZ_CLK               0x10
#define MEGAMUX_LP_GPIO_23_COEX_BLE_IN_PROCESS     0x15
#define MEGAMUX_LP_GPIO_23_UART0_TXD               0x1
#define MEGAMUX_LP_GPIO_23_UART1_TXD               0x5
#define MEGAMUX_LP_GPIO_23_I2C1_SCL                0xb
#define MEGAMUX_LP_GPIO_23_COEX_WLAN_RX            0x12
#define MEGAMUX_LP_GPIO_23_COEX_WLAN_TX            0x11
#define MEGAMUX_LP_GPIO_23_PWM1_OUT                0xd
#define MEGAMUX_LP_GPIO_23_QUAD_DEC0_B             0x1e
#define MEGAMUX_LP_GPIO_23_UART1_RTS               0x7
#define MEGAMUX_LP_GPIO_23_UART0_CTS               0x2
#define MEGAMUX_LP_GPIO_23_UART1_RXD               0x4
#define MEGAMUX_LP_GPIO_23_COEX_BLE_PTI_0          0x19
#define MEGAMUX_LP_GPIO_23_COEX_BLE_PTI_1          0x1a
#define MEGAMUX_LP_GPIO_23_COEX_BLE_PTI_2          0x1b
#define MEGAMUX_LP_GPIO_23_COEX_BLE_PTI_3          0x1c
#define MEGAMUX_LP_GPIO_23_I2C1_SDA                0xa
#define MEGAMUX_LP_GPIO_23_I2C0_SDA                0x8
#define MEGAMUX_LP_GPIO_23_COEX_BLE_SYNC           0x17
#define MEGAMUX_LP_GPIO_23_QUAD_DEC2_A             0x21
#define MEGAMUX_LP_GPIO_23_QUAD_DEC2_B             0x22
#define MEGAMUX_LP_GPIO_23_COEX_BLE_RX             0x14
#define MEGAMUX_LP_GPIO_23_QUAD_DEC1_B             0x20
#define MEGAMUX_LP_GPIO_23_PWM3_OUT                0xf
#define MEGAMUX_LP_GPIO_23_COEX_BLE_RXNTX          0x18
#define MEGAMUX_LP_GPIO_23_QUAD_DEC0_A             0x1d
#define MEGAMUX_LP_GPIO_23_PWM0_OUT                0xc
#define MEGAMUX_LP_GPIO_23_QUAD_DEC1_A             0x1f
#define MEGAMUX_LP_GPIO_23_PWM2_OUT                0xe

