zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_samb11zr.h
#define PINMUX_LP_GPIO_18_M_QUAD_DEC2_A           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC2_A<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_QUAD_DEC2_B           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC2_B<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_RX           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_RX<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_QUAD_DEC1_B           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC1_B<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_PWM3_OUT              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_PWM3_OUT<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_QUAD_DEC0_A           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC0_A<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_PWM0_OUT              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_PWM0_OUT<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_QUAD_DEC1_A           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC1_A<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_PWM2_OUT              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_PWM2_OUT<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_TEST_OUT_18             ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_TEST_OUT_18 )
#define PINMUX_LP_GPIO_18_SPI0_SSN                ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_SPI0_SSN )
#define PINMUX_LP_GPIO_18_SPI1_MISO               ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_SPI1_MISO )
#define PINMUX_LP_GPIO_18_SPI_FLASH0_SSN          ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_SPI_FLASH0_SSN )
#define PINMUX_LP_GPIO_18_GPIO                    ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_GPIO )
/* PinMux macros for LP_GPIO_19 */
#define PINMUX_LP_GPIO_19_SPI_FLASH0_RXD          ( PIN_LP_GPIO_19<<16 | MUX_LP_GPIO_19_SPI_FLASH0_RXD )
#define PINMUX_LP_GPIO_19_M_I2C0_SCL              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_I2C0_SCL<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART1_CTS             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART1_CTS<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_TX           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_TX<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART0_RTS             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART0_RTS<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART0_RXD             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART0_RXD<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_32KHZ_CLK             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_32KHZ_CLK<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART0_TXD             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART0_TXD<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART1_TXD             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART1_TXD<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_I2C1_SCL              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_I2C1_SCL<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_WLAN_RX          ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_WLAN_RX<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_WLAN_TX          ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_WLAN_TX<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_PWM1_OUT              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_PWM1_OUT<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC0_B           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC0_B<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART1_RTS             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART1_RTS<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART0_CTS             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART0_CTS<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_UART1_RXD             ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_UART1_RXD<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_I2C1_SDA              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_I2C1_SDA<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_I2C0_SDA              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_I2C0_SDA<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC2_A           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC2_A<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC2_B           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC2_B<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_RX           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_RX<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC1_B           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC1_B<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_PWM3_OUT              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_PWM3_OUT<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC0_A           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC0_A<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_PWM0_OUT              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_PWM0_OUT<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_QUAD_DEC1_A           ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_QUAD_DEC1_A<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_M_PWM2_OUT              ( PIN_LP_GPIO_19<<16 | MEGAMUX_LP_GPIO_19_PWM2_OUT<<8 | MUX_LP_GPIO_19_MEGAMUX )
#define PINMUX_LP_GPIO_19_SPI0_MISO               ( PIN_LP_GPIO_19<<16 | MUX_LP_GPIO_19_SPI0_MISO )
#define PINMUX_LP_GPIO_19_TEST_OUT_19             ( PIN_LP_GPIO_19<<16 | MUX_LP_GPIO_19_TEST_OUT_19 )
#define PINMUX_LP_GPIO_19_SPI1_MOSI               ( PIN_LP_GPIO_19<<16 | MUX_LP_GPIO_19_SPI1_MOSI )
#define PINMUX_LP_GPIO_19_GPIO                    ( PIN_LP_GPIO_19<<16 | MUX_LP_GPIO_19_GPIO )

#endif /* _SAMB11ZR_PIO_ */
